RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/inc/hc32f460_timer6.h
/**
 ******************************************************************************
 ** \brief Timer6 port input config
** \note
 ******************************************************************************/
typedef struct stc_timer6_port_input_cfg
{
    en_timer6_input_port_t     enPortSel;      ///< Port select
    en_timer6_func_mode_t      enPortMode;     ///< Port mode
    bool                       bFltEn;         ///< trig source capture input filter enable
    en_timer6_fconr_fltclk_t   enFltClk;       ///< Filter clock
}stc_timer6_port_input_cfg_t;

/**
 ******************************************************************************
 ** \brief Timer6 hardware dead time function config
 ** \note
 ******************************************************************************/
typedef struct stc_timer6_deadtime_cfg
{
    bool        bEnDeadtime;        ///< Enable hardware dead time function
    bool        bEnDtBufUp;         ///< Enable buffer transfer for up count dead time register(DTUBR-->DTUAR)
    bool        bEnDtBufDwn;        ///< Enable buffer transfer for down count dead time register(DTDBR-->DTDAR)
    bool        bEnDtEqualUpDwn;    ///< Enable down count dead time register equal to up count DT register
}stc_timer6_deadtime_cfg_t;

/**
 ******************************************************************************
 ** \brief Timer6 valid period config
 ** \note
 ******************************************************************************/
typedef struct stc_timer6_validper_cfg
{
    en_timer6_vperr_pcnts_t    enValidCntNum;  ///< Valid period selection
    en_timer6_vperr_pcnte_t    enValidCdtEn;   ///< Count condition of valid period
    bool                       bPeriodSCMA;    ///< Sepcial signal A valid period selection enable
    bool                       bPeriodSCMB;    ///< Sepcial signal A valid period selection enable
}stc_timer6_validper_cfg_t;

/**
 ******************************************************************************
 ** \brief Timer6 general compare register buffer transfer config
 ** \note
 ******************************************************************************/
typedef struct stc_timer6_gcmp_buf_cfg
{
    bool                        bEnGcmpTransBuf;      ///< Enable/Disable buffer transfer
    en_timer6_buf_gcmp_prd_t    enGcmpBufTransType;   ///< Sigle or double buffer transfer
}stc_timer6_gcmp_buf_cfg_t;

/**
 ******************************************************************************
 ** \brief Timer6 period register buffer transfer config
 ** \note
 ******************************************************************************/
typedef struct stc_timer6_period_buf_cfg
{
    bool                        bEnPeriodTransBuf;    ///< Enable/Disable buffer transfer
    en_timer6_buf_gcmp_prd_t    enPeriodBufTransType; ///< Sigle or double buffer transfer
}stc_timer6_period_buf_cfg_t;

/**
 ******************************************************************************
 ** \brief Timer6 Specila compare register buffer transfer config
 ** \note
 ******************************************************************************/
typedef struct stc_timer6_spcl_buf_cfg
{
    bool                        bEnSpclTransBuf;      ///< Enable/Disable buffer transfer
    en_timer6_buf_spcl_cmp_t    enSpclBufTransType;   ///< Sigle or double buffer transfer
    en_timer6_buf_spcl_opt_t    enSpclBufOptType;     ///< Buffer transfer opportunity
}stc_timer6_spcl_buf_cfg_t;

/**
 ******************************************************************************
 ** \brief Timer6 Z phase input mask config
 ** \note
 ******************************************************************************/
typedef struct stc_timer6_zmask_cfg
{
    en_timer6_gconr_zmsk_t     enZMaskCycle;              ///< Z phase input mask periods selection
    bool                       bFltPosCntMaksEn;          ///< As position count timer, position counter clear function enable(TRUE) or disable(FALSE) during the time of Z phase input mask
    bool                       bFltRevCntMaksEn;          ///< As revolution count timer, the counter function enable(TRUE) or disable(FALSE) during the time of Z phase input mask
}stc_timer6_zmask_cfg_t;

/*******************************************************************************
 * Global pre-processor symbols/macros ('#define')
 ******************************************************************************/

/*******************************************************************************
 * Global variable definitions ('extern')
 ******************************************************************************/

/*******************************************************************************
  Global function prototypes (definition in C source)
 ******************************************************************************/
/* IRQ config */
en_result_t Timer6_ConfigIrq(M4_TMR6_TypeDef *TMR6x, en_timer6_irq_type_t enTimer6Irq, bool bEn);
/* Get status(flag) */
uint8_t Timer6_GetStatus(M4_TMR6_TypeDef *TMR6x, en_timer6_status_t enStatus);

/* Base functions */
en_result_t Timer6_DeInit(M4_TMR6_TypeDef *TMR6x);
en_result_t Timer6_Init(M4_TMR6_TypeDef *TMR6x, const stc_timer6_basecnt_cfg_t* pstcTimer6BaseCntCfg);
/* Timer6 unit start count*/
en_result_t Timer6_StartCount(M4_TMR6_TypeDef *TMR6x);
/* Timer6 unit stop count*/
en_result_t Timer6_StopCount(M4_TMR6_TypeDef *TMR6x);
/* Timer6 unit Set Count Value*/
en_result_t Timer6_SetCount(M4_TMR6_TypeDef *TMR6x, uint16_t u16Value);
/* Timer6 unit Get Count Value*/
uint16_t Timer6_GetCount(M4_TMR6_TypeDef *TMR6x);
/* Timer6 unit Clear Count Value*/
en_result_t Timer6_ClearCount(M4_TMR6_TypeDef *TMR6x);

/* Timer6 unit Set Period and buffer Value*/
en_result_t Timer6_SetPeriod(M4_TMR6_TypeDef *TMR6x, en_timer6_period_t enTimer6Periodx, uint16_t u16Period);
/* Timer6 unit set general compare register value*/
en_result_t Timer6_SetGeneralCmpValue(M4_TMR6_TypeDef *TMR6x, en_timer6_compare_t enTimer6Compare, uint16_t u16Compare);
/* Timer6 unit set specoal compare register value*/
en_result_t Timer6_SetSpecialCmpValue(M4_TMR6_TypeDef *TMR6x, en_timer6_special_compare_t enTimer6SpclCmp, uint16_t u16SpclCmp);
/* Timer6 unit get general compare register value*/
uint16_t Timer6_GetGeneralCmpValue(M4_TMR6_TypeDef *TMR6x, en_timer6_compare_t enTimer6Compare);

/* Timer6 unit set period buffer transfer function*/
en_result_t Timer6_SetPeriodBuf(M4_TMR6_TypeDef *TMR6x, const stc_timer6_period_buf_cfg_t* pstcTimer6PrdBufCfg);
/* Timer6 unit set general compare buffer transfer function*/
en_result_t Timer6_SetGeneralBuf(M4_TMR6_TypeDef *TMR6x, en_timer6_chx_port_t enTimer6PWMPort, const stc_timer6_gcmp_buf_cfg_t* pstcTimer6GenBufCfg);
/* Timer6 unit set special compare buffer transfer function*/
en_result_t Timer6_SetSpecialBuf(M4_TMR6_TypeDef *TMR6x,en_timer6_special_compare_t enTimer6SpclCmp, const stc_timer6_spcl_buf_cfg_t* pstcTimer6SpclBufCfg);

/* Timer6 unit Set valid period Value*/
en_result_t Timer6_SetValidPeriod(M4_TMR6_TypeDef *TMR6x, const stc_timer6_validper_cfg_t* pstcTimer6ValidPerCfg);

